andrew-2.3.1/run/tutorials/multiphase/potentialFreeSurfaceDyMFoam/oscillatingBox/system/topoSetDict-selectBottom
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    floatingObjectBottom;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name   floatingObject;
        }
    }

    {
        name    floatingObjectBottom;
        type    faceSet;
        action  subset;
        source  normalToFace;
        sourceInfo
        {
            normal (0 1 0);     // Vector
            cos     0.01;       // Tolerance (max cos of angle)
        }
    }
);

// ************************************************************************* //
